src/DataProcessors/МассоваяВыдачаПокупок/МассоваяВыдачаПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МассоваяВыдачаПокупок</name>
</mdclass:DataProcessor>

src/InformationRegisters/УчастникиВГруппах/УчастникиВГруппах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиВГруппах</name>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Потерян</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Расходная/Расходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расходная</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Возвраты</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискНикаСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОплачиваетОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВыдачи</name>
    <type>
      <types>EnumRef.СтатусыВыдачиПокупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартаУчастника</name>
    <type>
      <types>CatalogRef.КартыУчастников</types>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧекОтмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Потерян</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Посылки</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.КорректировкаЗаписейРегистров</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплатить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСсылка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Праздники</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПокупкаСпр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/МассоваяВыдачаПокупок/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ГруппаУчастниковПриИзменении(Элемент)
	СписокУчастников=	ПолучитьУчастниковПоГруппе(ГруппаУчастников);
	ОбновитьСписокДокументов();
КонецПроцедуры

&НаСервере
Функция   ПолучитьУчастниковПоГруппе(ГруппаУчастников)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиВГруппах.Участник
		|ИЗ
		|	РегистрСведений.УчастникиВГруппах КАК УчастникиВГруппах
		|ГДЕ
		|	УчастникиВГруппах.Группа = &Группа";

	Запрос.Параметры.Вставить("Группа",ГруппаУчастников);
	выборка=Запрос.Выполнить().Выбрать();
	СЗ=Новый СписокЗначений;
	Пока выборка.Следующий()  Цикл
		СЗ.Добавить(выборка.участник,,истина);	
	КонецЦикла;
	Возврат СЗ;
КонецФункции // ПолучитьУчастниковПоГруппе()


&НаКлиенте
Процедура ВыдатьПокупки(Команда)

	ВыдатьПокупкиНаСервере(Списывать);
    ОбновитьСписокДокументов();
КонецПроцедуры

Процедура ВыдатьПокупкиНаСервере(Списывать)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Участник КАК Участник,
		|	ОстаткиТоваровОстатки.Потерян,
		|	ОстаткиТоваровОстатки.Покупка,
		|	ОстаткиТоваровОстатки.Оплачен,
		|	ОстаткиТоваровОстатки.МестоХранения,
		|	ОстаткиТоваровОстатки.Габарит,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК Количество,
		|	ОстаткиТоваровОстатки.Партия,
		|	Покупки.Наименование КАК ПокупкаСпр,
		|	РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата,&НаДату, ДЕНЬ) КАК ВремяХранения,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата, &НаДату, ДЕНЬ) > ОстаткиТоваровОстатки.Габарит.ДниХранения
		|			ТОГДА (ОстаткиТоваровОстатки.Габарит.СтоимостьХранения + (РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата, &НаДату, ДЕНЬ) - ОстаткиТоваровОстатки.Габарит.ДниХранения) * ОстаткиТоваровОстатки.Габарит.ДобавочнаяСтоимость) * ОстаткиТоваровОстатки.КоличествоОстаток
		|		ИНАЧЕ ОстаткиТоваровОстатки.Габарит.СтоимостьХранения * ОстаткиТоваровОстатки.КоличествоОстаток
		|	КОНЕЦ КАК СтоимостьХранения
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			,
		|			Участник В (&СписокУчастников)
		|				И Оплачен
		|				И (НЕ Потерян)) КАК ОстаткиТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Покупки КАК Покупки
		|		ПО ОстаткиТоваровОстатки.Покупка = Покупки.Код
		|ИТОГИ ПО
		|	Участник";

	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокУчастников", ПолучитьСписокООтмеченныхУчастников(СписокУчастников));

	
	Результат = Запрос.Выполнить();

	ВыборкаУчастник = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаУчастник.Следующий() Цикл
		обРасходная=Документы.Расходная.СоздатьДокумент();
		обРасходная.Дата=ТекущаяДата();
		обРасходная.Списать=Списывать;
		обРасходная.Автозаполнение=ГруппаУчастников;
		обРасходная.Участник=ВыборкаУчастник.Участник;
		ВыборкаДетальныеЗаписи = ВыборкаУчастник.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрРасходная=обРасходная.Покупки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрРасходная,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		обРасходная.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;


КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала=НачалоДня(ТекущаяДата());
	Период.ДатаОкончания=КонецДня(ТекущаяДата());
	ОбновитьСписокДокументов();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокООтмеченныхУчастников(СписокУчастников)
	МассивУчастников=новый Массив;
	Для каждого стр из СписокУчастников Цикл
		если стр.Пометка Тогда
			МассивУчастников.Добавить(стр.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивУчастников;
КонецФункции
Процедура ОбновитьСписокДокументов()
	ДокументыУчастников.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	ДокументыУчастников.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	ДокументыУчастников.Параметры.УстановитьЗначениеПараметра("СписокУчастников",ПолучитьСписокООтмеченныхУчастников(СписокУчастников));
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьСписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура СписокУчастниковПриИзменении(Элемент)
	ОбновитьСписокДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	ПечатьДокументов();	
КонецПроцедуры

Процедура ПечатьДокументов()
	ПечатнаяФорма.Очистить();
	запрос=Новый Запрос;
	запрос.Текст=ДокументыУчастников.ТекстЗапроса;

	запрос.Параметры.Вставить("ДатаНачала",Период.ДатаНачала);
	запрос.Параметры.Вставить("ДатаОкончания",Период.ДатаОкончания);
	запрос.Параметры.Вставить("СписокУчастников",ПолучитьСписокООтмеченныхУчастников(СписокУчастников));
	тз=запрос.Выполнить().Выгрузить();
	Для каждого стр Из тз Цикл
		Чек(ПечатнаяФорма , стр.ссылка);
	КонецЦикла;
КонецПроцедуры




 &НаСервере
Процедура Чек(ТабДок, Ссылка) 

	Макет = Документы.Расходная.ПолучитьМакет("ПФ_MXL_Чек");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расходная.Дата,
	|	Расходная.Номер,
	|	Расходная.Участник,
	|	Расходная.ПоискНикаСтоимость КАК ЗаПоискНика,	
	|	Расходная.Покупки.(
	|		Покупка,
	|		ЕСТЬNULL(Расходная.Покупки.МестоХранения.Родитель.Наименование, """") + ""   \   "" + Расходная.Покупки.МестоХранения.Наименование КАК МестоХранения,
	|		ПокупкаСпр,
	|		Партия,
	|		Партия.Организатор КАК Организатор,
	|		ВремяХранения,
	|		СтоимостьХранения,
	|		Габарит,
	|		Потерян
	|	)
	|ИЗ
	|	Документ.Расходная КАК Расходная
	|ГДЕ
	|	Расходная.Ссылка В(&Ссылка)
	|	И Расходная.Покупки.Потерян = Ложь";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ЗаПоискНика = Макет.ПолучитьОбласть("ЗаПоискНика");

	ОбластьПокупкиШапка = Макет.ПолучитьОбласть("ПокупкиШапка");
	ОбластьПокупки = Макет.ПолучитьОбласть("Покупки");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ВставлятьРазделительСтраниц = Ложь;
	Итого=0;
	Пока Выборка.Следующий() Цикл
		//Если ВставлятьРазделительСтраниц Тогда
		//	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;

		//ТабДок.Вывести(ОбластьЗаголовок);
        ЗаПоискНика.Параметры.Заполнить(Выборка);
        СтоимостьПоиска=Выборка.ЗаПоискНика;

		Шапка.Параметры.Заполнить(Выборка);
		ОбластьПодвал.Параметры.Заполнить(Выборка);

		
    	Шапка.Параметры.Дата=Формат(Выборка.Дата,"ДЛФ=ДД");
		Шапка.Параметры.Номер=Число(Выборка.Номер);
		
		Шапка.Параметры.НазваниеОрганизации=Константы.НазваниеОрганизации.Получить();
//		Шапка.Параметры.Тел=Константы.Телефоны.Получить();

		ТабДок.Вывести(Шапка, Выборка.Уровень());

		//ТабДок.Вывести(ОбластьПокупкиШапка);
		ВыборкаПокупки = Выборка.Покупки.Выбрать();
		Пока ВыборкаПокупки.Следующий() Цикл
			ОбластьПокупки.Параметры.Заполнить(ВыборкаПокупки);
			покупка									= 	СП_РаботаСоСправочниками.ПолучитьПокупкуПо_Коду(ВыборкаПокупки.Покупка);
			ОбластьПокупки.Параметры.Организатор	=	покупка.Владелец.Наименование;
			ТабДок.Вывести(ОбластьПокупки, ВыборкаПокупки.Уровень());
			Итого= Итого+ВыборкаПокупки.СтоимостьХранения;
		КонецЦикла;
			
		//ВставлятьРазделительСтраниц = Истина;
		Если СтоимостьПоиска<>0 Тогда
			ТабДок.Вывести(ЗаПоискНика);
		КонецЕсли;

		ОбластьПодвал.Параметры.Итого=Итого+СтоимостьПоиска;
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	//}}
КонецПроцедуры


 &НаСервере
Процедура ЧекНЗ(ТабДок) 
    ТабДок.Очистить();
	Макет = Документы.Расходная.ПолучитьМакет("ПФ_MXL_Чек");
	Запрос = Новый Запрос;
	Запрос.Текст =

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Участник КАК Участник,
		|	Покупки.Владелец КАК Организатор,
		|	ОстаткиТоваровОстатки.Покупка,
		|	Покупки.Наименование КАК ПокупкаСпр,
		|	ОстаткиТоваровОстатки.МестоХранения,
		|	ОстаткиТоваровОстатки.Габарит,
		|	РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата, &НаДату, ДЕНЬ) КАК ВремяХранения,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата, &НаДату, ДЕНЬ) > ОстаткиТоваровОстатки.Габарит.ДниХранения
		|			ТОГДА (ОстаткиТоваровОстатки.Габарит.СтоимостьХранения + (РАЗНОСТЬДАТ(ОстаткиТоваровОстатки.Партия.Дата, &НаДату, ДЕНЬ) - ОстаткиТоваровОстатки.Габарит.ДниХранения) * ОстаткиТоваровОстатки.Габарит.ДобавочнаяСтоимость) * ОстаткиТоваровОстатки.КоличествоОстаток
		|		ИНАЧЕ ОстаткиТоваровОстатки.Габарит.СтоимостьХранения * ОстаткиТоваровОстатки.КоличествоОстаток
		|	КОНЕЦ КАК СтоимостьХранения
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			,
		|			Участник В (&СписокУчастников)
		|				И Оплачен
		|				И (НЕ Потерян)) КАК ОстаткиТоваровОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Покупки КАК Покупки
		|		ПО ОстаткиТоваровОстатки.Покупка = Покупки.Код
		|ИТОГИ ПО
		|	Участник";

	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокУчастников", ПолучитьСписокООтмеченныхУчастников(СписокУчастников));

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ЗаПоискНика = Макет.ПолучитьОбласть("ЗаПоискНика");

	ОбластьПокупкиШапка = Макет.ПолучитьОбласть("ПокупкиШапка");
	ОбластьПокупки = Макет.ПолучитьОбласть("Покупки");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ВставлятьРазделительСтраниц = Ложь;
	
	
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаУчастник
        Итого=0;

        ЗаПоискНика.Параметры.Заполнить(Выборка);
        СтоимостьПоиска=0;

		Шапка.Параметры.Заполнить(Выборка);
		ОбластьПодвал.Параметры.Заполнить(Выборка);

		
    	Шапка.Параметры.Дата=Формат(ТекущаяДата(),"ДЛФ=ДД");
		Шапка.Параметры.Номер="___";
		
		Шапка.Параметры.НазваниеОрганизации=Константы.НазваниеОрганизации.Получить();
//		Шапка.Параметры.Тел=Константы.Телефоны.Получить();

		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВыборкаПокупки = Выборка.Выбрать();

		Пока ВыборкаПокупки.Следующий() Цикл
			ОбластьПокупки.Параметры.Заполнить(ВыборкаПокупки);
			ТабДок.Вывести(ОбластьПокупки);
			Итого= Итого+ВыборкаПокупки.СтоимостьХранения;
		КонецЦикла;
		Если СтоимостьПоиска<>0 Тогда
			ТабДок.Вывести(ЗаПоискНика);
		КонецЕсли;

		ОбластьПодвал.Параметры.Итого=Итого+СтоимостьПоиска;
		ТабДок.Вывести(ОбластьПодвал);


	КонецЦикла;
 	                                                     

КонецПроцедуры




&НаКлиенте
Процедура Печать(Команда)
	ПечатнаяФорма.Напечатать();
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПокупок(Команда)
	 ЧекНЗ(ПечатнаяФорма);
КонецПроцедуры
